УРВ_файловая/src/Documents/КомментарийПользователя/КомментарийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомментарийПользователя</name>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.КомментарийПользователя</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.КомментарийПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.КомментарийПользователя</types>
      <types>CatalogRef.Пожелания</types>
      <types>DocumentRef.Обращение</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/InformationRegisters/ИзбранныеПожелания/ИзбранныеПожелания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеПожелания</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пожелание</name>
    <type>
      <types>CatalogRef.Пожелания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Documents/КомментарийПользователя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Взаимодействия.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		ИсходныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");
	Иначе 
		ИсходныеРеквизиты = Новый Структура;
		ИсходныеРеквизиты.Вставить("ПометкаУдаления", Ложь);
    КонецЕсли;
    
    Входящий = Не ЦентрИдей.ЭтоКомментарийСлужбыПоддержки(Автор);
    
    ЗначениеОписания = ОписаниеХранилище.Получить();
	Если ТипЗнч(ЗначениеОписания) = Тип("ФорматированныйДокумент") Тогда 
		Описание = ЗначениеОписания.ПолучитьТекст();
	КонецЕсли;
    
    ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
    
    Если Не ЗначениеЗаполнено(Номер) Тогда
        УстановитьНовыйНомер();
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Сервис) Тогда
    	Если ДополнительныеСвойства.Свойство("Предмет") Тогда
			ТекущийПредмет = ДополнительныеСвойства.Предмет;
            Принадлежность = БазаЗнаний.ОсновнаяПринадлежностьКарточки(ТекущийПредмет);
            Сервис = Принадлежность.Сервис;
            Витрина = Принадлежность.Витрина;
        КонецЕсли;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Витрина) Тогда
        Витрина = БазаЗнанийПовтИсп.ОсновнаяВитринаСервиса(Сервис);
    КонецЕсли;
    
    
	Если Не ЭтоНовый() Тогда
		Если ИсходныеРеквизиты.ПометкаУдаления И Не ПометкаУдаления Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
	КонецЕсли;
    
    АвторПредставление = Строка(Автор);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	Ответственный = Пользователи.АвторизованныйПользователь();
	Автор = Пользователи.АвторизованныйПользователь();
	
	ОписаниеХранилище = Новый ХранилищеЗначения(ОбъектКопирования.ОписаниеХранилище.Получить(), Новый СжатиеДанных(9));
	ОписаниеАвторИзменения = Неопределено;
	ОписаниеДатаИзменения = Неопределено;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВзаимодействияУСП.ПриЗаписи(ЭтотОбъект);
    
    Если ДополнительныеСвойства.ЭтоНовый Тогда
		Если ДополнительныеСвойства.Свойство("Предмет") Тогда
			ТекущийПредмет = ДополнительныеСвойства.Предмет;
		Иначе
			ТекущийПредмет = ВзаимодействияУСП.ПредметВзаимодействия(Ссылка);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущийПредмет) Тогда
			Возврат;
        КонецЕсли;
        
        ДанныеКонтекста = Новый Структура;
        ДанныеКонтекста.Вставить("Описание", Описание);
        
        КонтекстСобытия = БизнесСобытия.СформироватьКонтекстСобытия(ДанныеКонтекста);
        ВидСобытия = ?(Входящий, Справочники.ВидыБизнесСобытий.ПолученКомментарийОтПользователя, Справочники.ВидыБизнесСобытий.ОтправленКомментарийПользователю);
        БизнесСобытия.ЗарегистрироватьСобытие(ТекущийПредмет, ВидСобытия, КонтекстСобытия,,
            СтрШаблон(НСтр("ru='%1
                           |Описание: %2'"), Строка(ВидСобытия), БизнесСобытия.ПредставлениеЗначения(Описание)), Ссылка);
    КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
    КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("Предмет") Тогда
        ТекущийПредмет = ДополнительныеСвойства.Предмет;
    Иначе
        ТекущийПредмет = ВзаимодействияУСП.ПредметВзаимодействия(Ссылка);
    КонецЕсли;
    
    Если ТипЗнч(ТекущийПредмет) = Тип("СправочникСсылка.Пожелания") Тогда
        
        РегистрыНакопления.ЗначенияПоказателей.ДобавитьДвижение(
            Движения.ЗначенияПоказателей, Дата, ТекущийПредмет, Перечисления.ПоказателиКарточек.КоличествоКомментариев, 1);    
            
        НоваяЗапись = РегистрыСведений.ИзбранныеПожелания.СоздатьМенеджерЗаписи();
        НоваяЗапись.Пожелание = ТекущийПредмет;
        НоваяЗапись.Пользователь = Автор;
        НоваяЗапись.ДатаИзменения = ТекущаяУниверсальнаяДата();
        НоваяЗапись.Записать();
        Если Не ЗначениеЗаполнено(ВзаимодействиеОснование) Тогда
            РегистрыСведений.ОповещенияИнформационногоЦентра.ДобавитьОповещение(Ссылка);
        КонецЕсли;
        
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Вызывается при заполнении документа на основании
//
Процедура ЗаполнитьКонтакты(Контакты) Экспорт
	
	Если Не Взаимодействия.КонтактыЗаполнены(Контакты) Тогда
		Возврат;
	КонецЕсли;
	
	// В телефонный звонок переносим первого контакта
	Параметр = Контакты[0];
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		АбонентКонтакт       = Параметр.Контакт;
		АбонентКакСвязаться  = Параметр.Адрес;
		АбонентПредставление = Параметр.Представление;
	Иначе
		АбонентКонтакт = Параметр;
	КонецЕсли;
	
	Взаимодействия.ДозаполнитьПоляКонтактов(АбонентКонтакт, АбонентПредставление, 
		АбонентКакСвязаться, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
